---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailWarning
source: html/7ff6c7ab-f5f8-fe93-7493-ac60dc8b761b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailWarning Property

Fabrication Part Fitting Failed to Fit

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartFitFailWarning { get; }
```